-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-02-02 15:51:22
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `midterm_project`
--

-- --------------------------------------------------------

--
-- 資料表結構 `article`
--

CREATE TABLE `article` (
  `id` int(6) UNSIGNED NOT NULL,
  `date` date NOT NULL,
  `cover` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `title` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `content` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `update` datetime NOT NULL,
  `tag` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_id` int(6) UNSIGNED NOT NULL,
  `valid` int(4) UNSIGNED NOT NULL,
  `category_id` int(4) NOT NULL,
  `img_id` int(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `article`
--

INSERT INTO `article` (`id`, `date`, `cover`, `title`, `content`, `description`, `update`, `tag`, `user_id`, `valid`, `category_id`, `img_id`) VALUES
(1, '2024-01-11', '1', '2023帶狀課程圓滿結束', '時光飛逝，2023年快到尾聲，這一期的帶狀課程也要結束了。同學們學會做瓶中花園，老師也學會怎麼做出好吃的磅蛋糕。\r\n感謝同學百忙中抽空來上課，連續10個禮拜真的不容易，在匆匆進門時能聽到“來喝杯茶，吃個蛋糕”，洗滌一身疲憊，是真心的接待。\r\n訶梨勒是藥師佛手持藥草，象徵無比的祝福。訶梨勒藥草茶來自喜馬拉雅山2000公尺的高度，也是珍稀無比的存在。藥草的愛全程陪伴我們上完這一期的課程，帶入植   ', '1', '2024-02-02 14:29:00', '課程 \n有趣', 1, 1, 1, 0),
(2, '2024-01-12', '', '日常分享', '早上天氣很好，但下午好像要變濕冷\r\n了，除草工作告一段落玩玩稼接，騎\r\n車去路邊剪了幾支紅色朱槿枝條，很仔細挑選常見的大紅花品種，砧木有4株都是橘黃色的，最大株接了3支，中等的接了1支紅花和1支裂瓣，另外2株小的各皮接1支裂瓣，陽光不大就只套夾鏈袋防雨，不知道能成功幾支? ', '', '2024-01-12 03:21:35', '分享\n心得\n種植', 3, 1, 2, 1),
(3, '2024-01-13', '', '請教我種植櫛瓜的方法', '請教各位大大\r\n第一次種節瓜，已經種植兩個半月，肥也施了，葉子長了很漂亮，該去除的葉子也去了，為何生長的節瓜都不到巴掌大， 請各位大大指導              ', '', '2024-01-13 14:06:01', '櫛瓜\n種植\n方法\n詢問', 6, 1, 4, 2),
(4, '2024-01-14', '', '種植物讓人心情愉悅？心理師：\n花在植物上的時間，最後都會滋養自己', '心理師書賢說，其實不論是對待個案，或是對待自己，都是一樣的。我們願意花在花草上的時間、以及花在自己身上的時間，也會成為我們自己生命當中的滋養。\n從我略懂略懂一點點的園藝治療來說，幫植物換盆的過程，雖然工程浩大，但某種程度上面也是在換置你的心靈存放的地方。\n比方說，你已經在一個地方住了很久、或已經在一段關係裡面受困很長的時間，你很害怕如果移動或離開了這個地方，你某一部分的自己也會跟著剝離。', '', '2024-01-14 21:47:07', '文章\n分享\n愉悅', 1, 1, 1, 0),
(5, '2024-01-15', '', '詢問', '請問各位大大 蓮霧樹的樹葉為什麼會這樣子呢？該如何處理？謝謝大家', '', '2024-01-15 23:17:59', '詢問\n方法\n種植', 5, 1, 4, 3),
(6, '2024-01-16', '', '滿滿成就感的育苗移植~', '自己育苗移植3個月時間總算等到採用\n滿心歡喜又成就感滿滿的', '', '2024-01-16 15:31:00', '心得\n分享\n種植\n成就感', 10, 1, 2, 4),
(7, '2024-01-17', '', '近期分享~', '再次和大家分享一下新種的一批菜~', '', '2024-01-17 10:33:42', '分享\n', 15, 1, 2, 5),
(8, '2024-01-18', '', '繡球花問題詢問', '想請教大家 今天繡球花枝幹出現黑點 請問有解決方法嗎 謝謝大家', '', '2024-01-18 04:39:09', '問題\n繡球花', 8, 1, 4, 6),
(9, '2024-01-19', '', '六指山藥真神奇~', '我種出了六指山藥！太新奇了!', '', '2024-01-19 06:01:09', '山藥\n新奇\n有趣', 2, 1, 3, 7),
(10, '2024-01-20', '', '微造景課程的放鬆時光', '走入山林。\n微造景課程的同學難得一起走入山林，看群山翠綠有如貼上青苔，河水清澈像環氧樹脂，走在小路蜿蜒，呼吸新鮮空氣，聽蟲鳴鳥叫，心靈採集滿滿的自然景觀帶回瓶中造景。\n真是太開心了！', '', '2024-01-20 20:52:33', '課程\n分享\n心得', 9, 1, 3, 8),
(11, '2024-01-21', '', '番茄大豐收!!!', '今年的蕃茄好種\n最多的一串竟有六十多粒，太給力了', '', '2024-01-21 19:03:01', '心得\n種植', 10, 1, 2, 9),
(12, '2024-01-22', '', '日常分享-在舒服的天氣種植', '舒適的陰涼天氣，把開花的芫荽挖掉，想原\n地再重新播種一次，意外發現紅?菜開花，\n第一次看到花型還不錯~就把枝條剪一些直接阡插，芫荽另外地方播種，紅蘿蔔、波菜、也都再種一次', '', '2024-01-22 19:20:30', '分享\n種植\n蔬菜', 3, 1, 2, 10),
(13, '2024-01-23', '', '室內植栽流行，網美植物身\n價翻倍', '從他們養成綠手指及居家布置經驗中，能一窺這一波植栽流行與過去的不同，象徵植物對人們生活角色的變化。\n首先種植地點，過去大家會認為，植物要養在室外才種得好，因此「園藝」盛行，居家環境，好像也只能種植在陽台。\n不過現在，室內植栽大行其道，除了因疫情宅家時間大幅提高，為了培養在家也能從事的興趣，居家種植成為流行；也因現代人對生活品質愈加要求，兼具美感與養生的植物，是最快帶療癒的大自然進門的方法。\n第二，', '', '2024-01-23 01:28:22', '文章\n分享\n室內植栽', 1, 1, 1, 11),
(14, '2024-01-24', '', '詢問山竺葵種植方式', '10天前買了盆山竺葵\n這兩天發現葉子開始黃葉\n想詢問可以如何照顧？', '', '2024-01-24 18:32:55', '詢問\n山竺葵\n方法', 2, 1, 4, 12),
(15, '2024-01-25', '', '稼接心得分享', '早上又變冷了，先把白蘿蔔大梅花 挖出1壟改種紅蘿蔔，之後就巡園 看看有什麼花開了，梅、桃，榕芭樂、酪梨?其中比較特殊的是朱槿，母株是橘?色的，我給他稼接紅色朱槿，本來也是開紅色朱槿，但今天卻發現花裂開了，沒有看過這樣的花朵，而且有1朵顏色橘色帶紅色裂開，是不是變種了？還是只是氣候變化而已', '', '2024-01-25 17:03:46', '心得\n分享\n稼接', 15, 1, 2, 13),
(16, '2024-01-26', '', '我種的釋迦破紀錄拉!!', '土種釋迦大到一斤4兩．破去年一斤一的記錄了????', '', '2024-01-26 08:10:26', '釋迦\n分享', 20, 1, 2, 14),
(17, '2024-01-27', '', '瓶中花園課程心得分享', '這堂課學習到苔類的特性\n造景的大原則。\n如何維持瓶中生態恆定及適合植物生長的條件與環境。\n我完成了今天的作品\n“爬山的人”之後做出了興趣，又再創作了第二個作品。\n用雨花石做出來的質感及風景大不同。\n放上房子和小羊，好可愛，我叫它“山上的家”\n有可愛的羊兒在吃草，\n山前有溫馨可愛的小房子\n感覺很棒。\n很開心的學習，\n老師很幽默，也對植物花園充滿了滿滿的熱情，\n她樂於分享及傳遞對植物的了解及知識，也提', '', '2024-01-27 21:36:52', '分享\n課程\n心得', 19, 1, 3, 15),
(18, '2024-01-28', '', '詢問芒果葉', '請教各位前輩，芒果葉這樣的情形，\n是什麼問題？ 請大家指教 感激不盡', '', '2024-01-28 12:22:28', '問題\n芒果葉\n感恩', 2, 1, 4, 16),
(19, '2024-01-29', '', '成功冒出新芽囉~', '經過稍微整理，滿意！\n「光肥」服侍下，冒出不少新苗', '', '2024-01-29 11:36:11', '心得\n新苗', 10, 1, 2, 17),
(20, '2024-01-30', '', '白合的生長季到了!', '不知道有沒有也喜歡種百合的人，最近是百合的生長季了，可以試看看~\n《百合花鱗莖怎麼種植呢？》\n??時機：\n先確認自己手上的百合花生長期是否到了，如果還在休眠的季節，建議先放冷藏冰球，等生長期再拿出來種植，一般百合花大約在秋冬或早春是最適合生長的，若確定目前是生長期了，那麼就繼續看下去…\n??土壤：\n首先選擇疏鬆、透氣、排水良好的土壤，絕對不可積水，否則鱗莖會爛掉?。\n例如泥炭土混合一些顆粒狀介質(', '', '2024-01-30 08:30:40', '百合\n生長季', 4, 1, 2, 18),
(21, '0000-00-00', '', '111', '222 ', '', '2024-02-02 12:35:17', '', 1, 1, 1, 28),
(22, '2024-02-01', '', '222', '111 ', '', '2024-02-01 15:56:49', '', 1, 1, 1, 24);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `article`
--
ALTER TABLE `article`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `article`
--
ALTER TABLE `article`
  MODIFY `id` int(6) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=67;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
